templates/still_water/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0 // Initialize whole domain as Air
);

regions
(
    boxToCell
    {
        box (-100 -150 -100) (400 150 0); // Water from bottom up to z=0
        fieldValues
        (
            volScalarFieldValue alpha.water 1 // Set water phase
        );
    }
);

// ************************************************************************* //
